# Brewfile — managed by ~/.dotfiles/install.sh
# Install / update everything with:  brew bundle --file=~/.dotfiles/Brewfile

# --- Formulae (CLI tools) ---
brew "ffmpeg"
brew "gh"
brew "git"
brew "git-standup"
brew "gradle"
brew "imagemagick"
brew "jq"
brew "mkcert"
brew "mysql"
brew "node"
brew "nss"
brew "openssl"
brew "php"
brew "pipenv"
brew "starship"

# --- Fonts ---
cask "font-ibm-plex"
cask "font-jetbrains-mono"
cask "font-roboto"
cask "font-roboto-mono"

# --- Applications ---
cask "1password"
cask "adobe-creative-cloud"
cask "calibre"
cask "daisydisk"
cask "docker"
cask "dropbox"
cask "firefox"
cask "fork"
cask "google-chrome"
cask "google-drive"
cask "handbrake"
cask "hyper"
cask "insomnia"
cask "messenger"
cask "microsoft-edge"
cask "netnewswire"
cask "ngrok"
cask "notion"
cask "numi"
cask "raycast"
cask "roon"
cask "slack"
cask "spotify"
cask "tidal"
cask "transmit"
cask "typora"
cask "viscosity"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
